In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# Any results you write to the current directory are saved as output.

/kaggle/input/titanic/gender_submission.csv
/kaggle/input/titanic/test.csv
/kaggle/input/titanic/train.csv

In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:

train = pd.read_csv('/kaggle/input/titanic/train.csv')
test = pd.read_csv('/kaggle/input/titanic/test.csv')

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [6]:
test['Survived'] = np.nan

full = pd.concat([train, test])

In [7]:
full.shape

(1309, 12)

In [8]:
full.isnull().mean().sort_values(ascending = False)

Cabin          0.774637
Survived       0.319328
Age            0.200917
Embarked       0.001528
Fare           0.000764
Ticket         0.000000
SibSp          0.000000
Sex            0.000000
Pclass         0.000000
PassengerId    0.000000
Parch          0.000000
Name           0.000000
dtype: float64

In [9]:
from statistics import mode
full["Embarked"] = full["Embarked"].fillna(mode(full["Embarked"]))

In [10]:
full["Sex"][full["Sex"] == "male"] = 0
full["Sex"][full["Sex"] == "female"] = 1

full["Embarked"][full["Embarked"] == "S"] = 0
full["Embarked"][full["Embarked"] == "C"] = 1
full["Embarked"][full["Embarked"] == "Q"] = 2

In [11]:
full['Age'] = full.groupby("Pclass")['Age'].transform(lambda x: x.fillna(x.median()))
full['Fare'] = full.groupby("Pclass")['Fare'].transform(lambda x: x.fillna(x.median()))

In [12]:
full['Cabin'] = full['Cabin'].fillna('U') #U means undefined

In [13]:
full.isnull().mean().sort_values(ascending = False)

Survived       0.319328
Ticket         0.000000
SibSp          0.000000
Sex            0.000000
Pclass         0.000000
PassengerId    0.000000
Parch          0.000000
Name           0.000000
Fare           0.000000
Embarked       0.000000
Cabin          0.000000
Age            0.000000
dtype: float64

In [14]:
full['Cabin'].unique().tolist()

['U',
 'C85',
 'C123',
 'E46',
 'G6',
 'C103',
 'D56',
 'A6',
 'C23 C25 C27',
 'B78',
 'D33',
 'B30',
 'C52',
 'B28',
 'C83',
 'F33',
 'F G73',
 'E31',
 'A5',
 'D10 D12',
 'D26',
 'C110',
 'B58 B60',
 'E101',
 'F E69',
 'D47',
 'B86',
 'F2',
 'C2',
 'E33',
 'B19',
 'A7',
 'C49',
 'F4',
 'A32',
 'B4',
 'B80',
 'A31',
 'D36',
 'D15',
 'C93',
 'C78',
 'D35',
 'C87',
 'B77',
 'E67',
 'B94',
 'C125',
 'C99',
 'C118',
 'D7',
 'A19',
 'B49',
 'D',
 'C22 C26',
 'C106',
 'C65',
 'E36',
 'C54',
 'B57 B59 B63 B66',
 'C7',
 'E34',
 'C32',
 'B18',
 'C124',
 'C91',
 'E40',
 'T',
 'C128',
 'D37',
 'B35',
 'E50',
 'C82',
 'B96 B98',
 'E10',
 'E44',
 'A34',
 'C104',
 'C111',
 'C92',
 'E38',
 'D21',
 'E12',
 'E63',
 'A14',
 'B37',
 'C30',
 'D20',
 'B79',
 'E25',
 'D46',
 'B73',
 'C95',
 'B38',
 'B39',
 'B22',
 'C86',
 'C70',
 'A16',
 'C101',
 'C68',
 'A10',
 'E68',
 'B41',
 'A20',
 'D19',
 'D50',
 'D9',
 'A23',
 'B50',
 'A26',
 'D48',
 'E58',
 'C126',
 'B71',
 'B51 B53 B55',
 'D49',
 'B5',
 'B20',
 'F G63',
 'C62 C64',
 'E24',
 'C90',
 'C45',
 'E8',
 'B101',
 'D45',
 'C46',
 'D30',
 'E121',
 'D11',
 'E77',
 'F38',
 'B3',
 'D6',
 'B82 B84',
 'D17',
 'A36',
 'B102',
 'B69',
 'E49',
 'C47',
 'D28',
 'E17',
 'A24',
 'C50',
 'B42',
 'C148',
 'B45',
 'B36',
 'A21',
 'D34',
 'A9',
 'C31',
 'B61',
 'C53',
 'D43',
 'C130',
 'C132',
 'C55 C57',
 'C116',
 'F',
 'A29',
 'C6',
 'C28',
 'C51',
 'C97',
 'D22',
 'B10',
 'E45',
 'E52',
 'A11',
 'B11',
 'C80',
 'C89',
 'F E46',
 'B26',
 'F E57',
 'A18',
 'E60',
 'E39 E41',
 'B52 B54 B56',
 'C39',
 'B24',
 'D40',
 'D38',
 'C105']

In [15]:
import re

# Extracting (first) letter!
full['Cabin'] = full['Cabin'].map(lambda x: re.compile("([a-zA-Z]+)").search(x).group())
full['Cabin'].unique().tolist()

['U', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T']

In [16]:
cabin_category = {'A':1, 'B':2, 'C':3, 'D':4, 'E':5, 'F':6, 'G':7, 'T':8, 'U':9}
full['Cabin'] = full['Cabin'].map(cabin_category)
full['Cabin'].unique().tolist()

[9, 3, 5, 7, 4, 1, 2, 6, 8]

In [17]:
full['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [18]:
full['Title'] = full.Name.str.extract(' ([A-Za-z]+)\.', expand = False)
full['Title'].unique().tolist()

['Mr',
 'Mrs',
 'Miss',
 'Master',
 'Don',
 'Rev',
 'Dr',
 'Mme',
 'Ms',
 'Major',
 'Lady',
 'Sir',
 'Mlle',
 'Col',
 'Capt',
 'Countess',
 'Jonkheer',
 'Dona']

In [19]:
full['Title'].value_counts(normalize = True) * 100

Mr          57.830405
Miss        19.862490
Mrs         15.049656
Master       4.660046
Dr           0.611154
Rev          0.611154
Col          0.305577
Mlle         0.152788
Ms           0.152788
Major        0.152788
Lady         0.076394
Don          0.076394
Mme          0.076394
Capt         0.076394
Jonkheer     0.076394
Dona         0.076394
Sir          0.076394
Countess     0.076394
Name: Title, dtype: float64

In [20]:
full['Title'] = full['Title'].replace(['Rev', 'Dr', 'Col', 'Ms', 'Mlle', 'Major', 'Countess', 
                                       'Capt', 'Dona', 'Jonkheer', 'Lady', 'Sir', 'Mme', 'Don'], 'Other')

In [21]:
full['Title'].value_counts(normalize = True) * 100

Mr        57.830405
Miss      19.862490
Mrs       15.049656
Master     4.660046
Other      2.597403
Name: Title, dtype: float64

In [22]:
title_category = {'Mr':1, 'Miss':2, 'Mrs':3, 'Master':4, 'Other':5}
full['Title'] = full['Title'].map(title_category)
full['Title'].unique().tolist()

[1, 3, 2, 4, 5]

In [23]:

# +1 ,because he is one of the part of his family 
full['familySize'] = full['SibSp'] + full['Parch'] + 1

In [24]:
full.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,familySize
0,22.0,9,0,7.2500,"Braund, Mr. Owen Harris",0,1,3,0,1,0.0,A/5 21171,1,2
1,38.0,3,1,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,1,1,1.0,PC 17599,3,2
2,26.0,9,0,7.9250,"Heikkinen, Miss. Laina",0,3,3,1,0,1.0,STON/O2. 3101282,2,1
3,35.0,3,0,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,1,1,1.0,113803,3,2
4,35.0,9,0,8.0500,"Allen, Mr. William Henry",0,5,3,0,0,0.0,373450,1,1

In [25]:

full = full.drop(['Name', 'SibSp', 'Parch', 'Ticket'], axis = 1)

In [26]:
full.head()

,Age,Cabin,Embarked,Fare,PassengerId,Pclass,Sex,Survived,Title,familySize
0,22.0,9,0,7.2500,1,3,0,0.0,1,2
1,38.0,3,1,71.2833,2,1,1,1.0,3,2
2,26.0,9,0,7.9250,3,3,1,1.0,2,1
3,35.0,3,0,53.1000,4,1,1,1.0,3,2
4,35.0,9,0,8.0500,5,3,0,0.0,1,1

In [27]:
test = full[full['Survived'].isna()].drop(['Survived'], axis = 1)
print(test.head())

    Age  Cabin Embarked     Fare  PassengerId  Pclass Sex  Title  familySize
0  34.5      9        2   7.8292          892       3   0      1           1
1  47.0      9        0   7.0000          893       3   1      3           2
2  62.0      9        2   9.6875          894       2   0      1           1
3  27.0      9        0   8.6625          895       3   0      1           1
4  22.0      9        0  12.2875          896       3   1      3           3

In [28]:
# Recover train dataset
train = full[full['Survived'].notna()]
train.head()

,Age,Cabin,Embarked,Fare,PassengerId,Pclass,Sex,Survived,Title,familySize
0,22.0,9,0,7.2500,1,3,0,0.0,1,2
1,38.0,3,1,71.2833,2,1,1,1.0,3,2
2,26.0,9,0,7.9250,3,3,1,1.0,2,1
3,35.0,3,0,53.1000,4,1,1,1.0,3,2
4,35.0,9,0,8.0500,5,3,0,0.0,1,1

In [29]:
train['Survived'] = train['Survived'].astype(np.int8)
train.head()

,Age,Cabin,Embarked,Fare,PassengerId,Pclass,Sex,Survived,Title,familySize
0,22.0,9,0,7.2500,1,3,0,0,1,2
1,38.0,3,1,71.2833,2,1,1,1,3,2
2,26.0,9,0,7.9250,3,3,1,1,2,1
3,35.0,3,0,53.1000,4,1,1,1,3,2
4,35.0,9,0,8.0500,5,3,0,0,1,1

In [30]:
from sklearn.model_selection import train_test_split


X_train, X_test, y_train, y_test = train_test_split(train.drop(['Survived', 'PassengerId'], axis = 1), 
                                                    train['Survived'], test_size = 0.2, 
                                                    random_state = 2)
from sklearn.linear_model import LogisticRegression
logisticRegression = LogisticRegression(max_iter = 10000)
logisticRegression.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=10000,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [31]:
predictions = logisticRegression.predict(X_test)

In [32]:
from sklearn.model_selection import KFold

# Set our robust cross-validation scheme!
kf = KFold(n_splits = 5, random_state = 2)

In [33]:
from sklearn.model_selection import cross_val_score

# Print our CV accuracy estimate:
print(cross_val_score(logisticRegression, X_test, y_test, cv = kf).mean())

0.7763492063492063

In [34]:
from sklearn.ensemble import RandomForestClassifier

#Initialize randomForest
randomForest = RandomForestClassifier(random_state = 2)

In [35]:
# Set our parameter grid
param_grid = { 
    'criterion' : ['gini', 'entropy'],
    'n_estimators': [100, 300, 500],
    'max_features': ['auto', 'log2'],
    'max_depth' : [3, 5, 7]    
}

from sklearn.model_selection import GridSearchCV

# Grid search
randomForest_CV = GridSearchCV(estimator = randomForest, param_grid = param_grid, cv = 5)
randomForest_CV.fit(X_train, y_train)

GridSearchCV(cv=5, error_score=nan,
             estimator=RandomForestClassifier(bootstrap=True, ccp_alpha=0.0,
                                              class_weight=None,
                                              criterion='gini', max_depth=None,
                                              max_features='auto',
                                              max_leaf_nodes=None,
                                              max_samples=None,
                                              min_impurity_decrease=0.0,
                                              min_impurity_split=None,
                                              min_samples_leaf=1,
                                              min_samples_split=2,
                                              min_weight_fraction_leaf=0.0,
                                              n_estimators=100, n_jobs=None,
                                              oob_score=False, random_state=2,
                                              verbose=0, warm_start=False),
             iid='deprecated', n_jobs=None,
             param_grid={'criterion': ['gini', 'entropy'],
                         'max_depth': [3, 5, 7],
                         'max_features': ['auto', 'log2'],
                         'n_estimators': [100, 300, 500]},
             pre_dispatch='2*n_jobs', refit=True, return_train_score=False,
             scoring=None, verbose=0)

In [36]:
# Print best hyperparameters
randomForest_CV.best_params_

{'criterion': 'gini',
 'max_depth': 7,
 'max_features': 'auto',
 'n_estimators': 300}

In [37]:

randomForestFinalModel = RandomForestClassifier(random_state = 2, criterion = 'gini', max_depth = 7, max_features = 'auto', n_estimators = 300)

In [38]:
randomForestFinalModel.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=7, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=300,
                       n_jobs=None, oob_score=False, random_state=2, verbose=0,
                       warm_start=False)

In [39]:

predictions = randomForestFinalModel.predict(X_test)

In [40]:
# Predict!
test['Survived'] = randomForestFinalModel.predict(test.drop(['PassengerId'], axis = 1))

In [41]:

test[['PassengerId', 'Survived']].to_csv('second_submission.csv', index = False)